modm-ext/data.modm.io/docs/svd/header_stm32g0b0xx.svd
        <register>
          <name>ITLINE19_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIM14_GLB</name>
              <description>TIM14 GLB Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE20_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIM15_GLB</name>
              <description>TIM15 GLB Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE21_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIM16_GLB</name>
              <description>TIM16 GLB Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE22_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIM17_GLB</name>
              <description>TIM17 GLB Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE23_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C1_GLB</name>
              <description>I2C1 GLB Interrupt -&gt; exti[23]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE24_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C2_GLB</name>
              <description>I2C2 GLB Interrupt -&gt; exti[22]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3_GLB</name>
              <description>I2C3 GLB Interrupt -&gt; exti[24]</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE25_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI1</name>
              <description>SPI1 Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE26_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI2</name>
              <description>SPI2 Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI3</name>
              <description>SPI3 Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE27_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USART1_GLB</name>
              <description>USART1 GLB Interrupt -&gt; exti[25]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE28_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USART2_GLB</name>
              <description>USART2 GLB Interrupt -&gt; exti[26]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE29_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USART3_GLB</name>
              <description>USART3 GLB Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART4_GLB</name>
              <description>USART4 GLB Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART5_GLB</name>
              <description>USART5 GLB Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART6_GLB</name>
              <description>USART6 GLB Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IT_LINE_SR29</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR30</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR31</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
        </register>
